[{"Field Name ":"last-modified-timestamp","Description":"The timestamp, in milliseconds, when the member's profile was last edited."},{"Field Name ":"proposal-comments","Description":"A short-form text area describing how the member approaches proposals. "},{"Field Name ":"associations","Description":"A short-form text area listing the various associations the member is a part of. "},{"Field Name ":"interests","Description":"A short-form text area describing the member's interests. "},{"Field Name ":"publications","Description":"An object representing the various publications associated with the member.  See Publication Fields for a description of the fields available within this object. "},{"Field Name ":"patents","Description":"An object representing the various patents associated with the member.  See Patent Fields for a description of the fields available within this object."},{"Field Name ":"languages","Description":"An object representing the languages that the member knows.  See Language Fields for a description of the fields available within this object."},{"Field Name ":"skills","Description":"An object representing the skills that the member holds.  See Skill Fields for a description of the fields available within this object."},{"Field Name ":"certifications","Description":"An object representing the certifications that the member holds.  See Certification Fields for a description of the fields available within this object."},{"Field Name ":"educations","Description":"An object representing the user's educational background.  See Education Fields for a description of the fields available within this object."},{"Field Name ":"courses","Description":"An object representing courses the member has taken.  See Course Fields for a description of the fields available within this object."},{"Field Name ":"volunteer","Description":"An object representing the member's volunteer experience.  See Volunteer Fields for a description of the fields available within this object."},{"Field Name ":"three-current-positions","Description":"A collection of current positions that the member holds, capped at three.  See Position Fields for a description of the fields available within this object."},{"Field Name ":"three-past-positions","Description":"A collection of the most recent past positions that the member held, capped at three.  See Position Fields for a description of the fields available within this object."},{"Field Name ":"num-recommenders","Description":"The number of recommendations that the member has. "},{"Field Name ":"recommendations-received","Description":"An object representing the recommendations that the member has received.  See Recommendation Fields for a description of the fields available within this object."},{"Field Name ":"following","Description":"An collection of people, company and industries that the member is following."},{"Field Name ":"job-bookmarks","Description":"A collection of jobs that the member is following. "},{"Field Name ":"suggestions","Description":"A collection of people, companies and industries suggested for the member to follow. "},{"Field Name ":"date-of-birth","Description":"The member's date of birth.  This field may not return the year as part of the date, if the member has not provided it. "},{"Field Name ":"member-url-resources","Description":"An object representing the URLs the member has shared on their LinkedIn profile. "},{"Field Name ":"related-profile-views","Description":"An object listing related member profiles that were viewed before or after the member's profile. "},{"Field Name ":"honors-awards","Description":"An object representing the various honors and awards the member has received. "}]
